{
    "introduction": "Hi, I'm Ryan McDonough, a software developer based in Boston, MA.",
    "skills": [
        "Ruby on Rails",
        "JavaScript",
        "TypeScript",
        "React",
        "Node.js",
        "Next.js",
        "Python",
        "C/C++",
        "Java",
        "HTML",
        "CSS",
        "Tailwind",
        "Bash/Shell",
        "SQL",
        "GraphQL",
        "MongoDB",
        "Snowflake",
        "RSpec",
        "Capybara",
        "Selenium",
        "AWS"
    ],
    "contact": {
        "email": "McDonoughRyan95@gmail.com"
    },
  "experience": [
    {
      "title": "Software Engineer",
      "company": "Linksquares",
      "duration": "11/2023 - 01/2025",
      "description": [
        "Developed scalable solutions using Ruby on Rails, React, SQL, and GraphQL across 4 repositories.",
        "Worked closely with Sales and Marketing teams to deliver high-priority, time-sensitive features, analytics, and integrations by a deadline.",
        "Independently designed and implemented an internal API key management system that enabled clients to view key names and manage activation without exposing key values.",
        "Built and maintained integrations between internal and third-party systems, optimizing customer workflows, effectively reducing churn and increasing customer satisfaction.",
        "Adapted quickly to diverse projects, managing frequent context switching between multiple applications, internal tools, integrations, and analytics dashboards to meet business objectives.",
        "Wrote comprehensive test coverage using RSpec, ensuring code reliability and robustness through well-structured unit, integration, and feature tests.",
        "Balanced competing priorities across projects with distinct requirements, demonstrating strong organizational skills and technical adaptability in a fast-paced environment."
      ]
    },
    {
      "title": "Full-Stack Developer",
      "company": "Visible Body",
      "duration": "06/2021 - 11/2023",
      "description": [
        "Orchestrated the design, development, and deployment of small and large features for a user base of over 250,000 through agile methodologies with Ruby on Rails, expanding the user base and enhancing user engagement.",
        "Spearheaded a JavaScript initiative that significantly reduced redirects, elevating user experience and bolstering overall system performance.",
        "Amplified total test coverage from a baseline of 0% to 70%, utilizing Ruby with Capybara and Selenium, resulting in enhanced product stability and quality.",
        "Formulated and executed SQL queries to extract critical insights, pivotal in shaping organizational strategies and swiftly resolving support issues.",
        "Substantially contributed to the creation of an automated UI test suite using Python, streamlining testing procedures and fortifying product reliability.",
        "Collaborated in the conceptualization, structuring, and execution of a novel admin panel, complete with custom role and permission systems for precise user access management.",
        "Integrated software seamlessly with Canvas REST API, fostering efficient and seamless communication pathways."
      ]
    },
    {
      "title": "Scrum Master",
      "company": "NUWC",
      "duration": "Sept 2019 - April 2020",
      "description": [
        "Spearheaded the design and development of an internal web application enabling seamless management, tracking, and distribution of all approval processes throughout the organization.",
        "Employed a comprehensive MERN stack (MongoDB, Express, React, Node) coupled with HTML, CSS, and JavaScript to create a robust and user-friendly platform.",
        "Directed weekly sprint reviews, ensuring project alignment and progression, while also presenting detailed bi-weekly scrum reports to stakeholders.",
        "Engineered a dynamic system, empowering users to establish distinct groups, construct intricate workflows (multi-step company approval processes), and facilitate efficient document upload and download procedures.",
        "Elected by peers to assume the speaking role for the final presentation."
      ]
    }
  ],
  "projects": [
    {
      "title": "NUWC Employee Workflow Tool (Senior Project)",
      "description": "An internal web application for managing approval processes."
    },
    {
      "title": "Personal Portfolio Website",
      "description": "A portfolio showcasing my projects and experience."
    }
  ],
  "education": {
    "degree": "Bachelor's Degree in Computer Science",
    "institution": "University of Massachusetts Dartmouth"
  },
  "personal": {
    "interests": [
        "technology",
        "music",
        "food",
        "traveling",
        "gaming"
    ],
    "hobbies": [
        "playing the guitar, bass, and piano",
        "producing music",
        "cooking",
        "trying new foods/restaurants",
        "playing video games"
    ]
  },
  "currents":{
    "music": [
        "MK.Gee",
        "Dijon",
        "Bob Dylan",
        "Charli XCX",
        "Chappell Roan"
    ],
    "shows": [
        "Severence"
    ]
  },
  "favorites": {
    "music": [
      "The Beatles",
      "Led Zeppelin",
      "Jim Croce",
      "Mk.Gee",
      "Grateful Dead",
      "Vampire Weekend",
      "The Strokes",
      "Anderson .Paak",
      "Mac Miller",
      "Kanye West",
      "Kendrick Lamar",
      "Tame Impala",
      "Tennis",
      "Frank Ocean",
      "Unknown Mortal Orchestra",
      "Dave Matthews Band",
      "John Mayer"
    ],
    "movies": [
      "Interstellar",
      "Superbad",
      "School of Rock",
      "The Lord of the Rings"
    ],
    "shows": [
      "Severence",
      "The Office",
      "Always Sunny in Philadelphia",
      "Game of Thrones",
      "Breaking Bad"
    ]
  }
}